blog-posts/2008-01-09-note-taking-random-notes-journal-entries-outlines-and-hyperlinks.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<title>Note-taking: Random notes, journal entries, outlines, and hyperlinks</title>
<!-- 2015-01-07 Wed 14:49 -->
<meta  http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta  name="generator" content="Org-mode" />
<link rel="stylesheet" type="text/css" href="../css/foundation.min.css"></link>
<link href='http://fonts.googleapis.com/css?family=Open+Sans' rel='stylesheet' type='text/css'></link>
<link rel="stylesheet" type="text/css" href="../css/org-export.css"></link>
<link rel="stylesheet" type="text/css" href="../css/style.css"></link>
<link rel="stylesheet" type="text/css" href="../css/emacs-notes.css"></link>
</head>
<body>
<div id="content">
<h1 class="title">Note-taking: Random notes, journal entries, outlines, and hyperlinks</h1>
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#sec-1">Random notes</a></li>
<li><a href="#sec-2">Journal entries</a></li>
<li><a href="#sec-3">Outlines</a></li>
<li><a href="#sec-4">Hyperlinked Text</a></li>
<li><a href="#sec-5">Search</a></li>
<li><a href="#sec-6">Feedback?</a></li>
</ul>
</div>
</div>
<p>
January 9th, 2008 -
<a href="http://sachachua.com/blog/p/4665"><a href="http://sachachua.com/blog/p/4665">http://sachachua.com/blog/p/4665</a></a>
</p>

<p>
I take at least three different kinds of notes, and I need to manage
them differently. Here are some rough thoughts on the different kinds of
notes I work with and how I manage them. I'd love to hear about your
note-management strategies in comments or e-mail!
</p>

<div id="outline-container-sec-1" class="outline-2">
<h2 id="sec-1">Random notes</h2>
<div class="outline-text-2" id="text-1">
<p>
When I worked on my thesis, I filed hundreds of lines from my literature
review. I needed to quickly pull together just the notes matching a
certain keyword or belonging to a particular section. I also needed to
be able to properly cite each note. Lastly, I structured my notes so
that I could get a random note, which turned out to be really helpful
for breaking me out of writing ruts and for helping me see creative
connections.
</p>

<p>
Writers and public speakers keep similar databases of story ideas and
great quotations. They need to be able to search their databases for
matching records, and they might not think of these categories ahead of
time.
</p>

<p>
Random information management isn't just for word geeks and researchers.
If you've got scraps of paper or a text file with notes from meetings,
clips from interesting articles, and thoughts to yourself, you're
already managing random information. You just might not have a good
system for capturing and searching the information.
</p>

<p>
Important things for a random information manager:
</p>

<ul class="org-ul">
<li>You should be able to easily capture information.
</li>
<li>You should be able to easily search for information.
</li>
</ul>

<p>
(An ideal random information manager might even suggest relevant
entries.
 Come to think of it, I should find out if I can get the Remembrance
Agent running again. That was really cool.)
</p>

<p>
I started using Howm for this before. It was a great random information
manager for Emacs. I haven't been using it lately, though, as I hadn't
set it up on my work laptop. I might do so soon.
</p>
</div>
</div>
<div id="outline-container-sec-2" class="outline-2">
<h2 id="sec-2">Journal entries</h2>
<div class="outline-text-2" id="text-2">
<p>
Journal entries tend to be short, chronological notes. They can be
private or public, or a mix of both. They can be also be retrospective
or forward-looking. Journal entries are more structured than random
information snippets because they're associated with a specific date and
are generally about activities, experiences, or goals.
</p>

<p>
My blog is an example of a journal. It has public and private entries.
The private entries are removed from the blog before publishing.
</p>

<p>
Important things for a journal manager or a blog:
</p>

<ul class="org-ul">
<li>You shouldn't have to enter date and time yourself.
</li>
<li>You should be able to flip through your entries or search them for
keywords.
</li>
<li>You should be able to get an overview of your notes for a time
period.
</li>
</ul>

<p>
I use Planner for this because Planner makes it easy to publish day
pages and RSS. I also write some entries directly on a WordPress blog,
which also imports my Planner blog entries.
</p>
</div>
</div>
<div id="outline-container-sec-3" class="outline-2">
<h2 id="sec-3">Outlines</h2>
<div class="outline-text-2" id="text-3">
<p>
Some notes belong to a bigger structure. For example, if you're drafting
a document, you might work on different sections that will ultimately be
merged. Random information management and journals are not enough
because you need structure. An outline helps you see how things fit
together.
</p>

<p>
The draft for this book is an example of an outline. I sometimes work
top-down by starting with the headings and defining more detail. I also
work bottom-up by writing blocks of content and then fitting them into
my outline.
</p>

<p>
Important things for an outline:
</p>

<ul class="org-ul">
<li>You should be able to structure your notes into headings and
subheadings.
</li>
<li>You should be able to promote, demote, and rearrange those headings
quickly.
</li>
<li>You should be able to quickly get an overview or drill down into
detail.
</li>
</ul>

<p>
I use Org for outlined text because Org makes it really easy to
manipulate outlines.
</p>
</div>
</div>
<div id="outline-container-sec-4" class="outline-2">
<h2 id="sec-4">Hyperlinked Text</h2>
<div class="outline-text-2" id="text-4">
<p>
The structure of hyperlinked text can actually be applied to the other
three types of notes. Random notes benefit from freely-defined
hyperlinks, where you can specify keywords that will automatically be
linked without needing to edit each note where the keyword occurs.
Journal entries can link to other journal entries or to topic-oriented
pages. Outlines and other documents may allow people to jump to related
sections through hyperlinks. Hyperlinks allow you to work with more
freedom than a strict hierarchy of topics would permit.
</p>

<p>
An example of a hyperlinked note system would be the way the posts on my
blog are often linked with plan pages that focus on specific topics.
(These links are only on my hard disk, so don't worry if you don't see
them!) Topic pages allow me to review my topic-related notes as well as
other freeform notes I've added.
</p>

<p>
Important things for hyperlinks:
</p>

<ul class="org-ul">
<li>You should be able to link to resources outside the note-taking
system.
</li>
<li>You should be able to link to other notes in the note-taking system.
</li>
<li>You may want to be able to link to other sections of the same note.
</li>
</ul>

<p>
I tend to use Muse with Planner for hyperlinked pages, but I've also
tried it with Howm.
</p>
</div>
</div>
<div id="outline-container-sec-5" class="outline-2">
<h2 id="sec-5">Search</h2>
<div class="outline-text-2" id="text-5">
<p>
A note-taking system good at capturing journal entries may not
necessarily be good at capturing and searching random information or
managing outlines. It helps to have different note-taking systems, each
optimized for different tasks, or a tool that adapts to what you need at
that time. A search that spans your different note-taking systems is
also a great help.
</p>

<p>
Currently, I don't have a unified search system. Well, aside from
grep&#x2026; This is one of the things I plan to work on while writing this
chapter. =)
</p>
</div>
</div>
<div id="outline-container-sec-6" class="outline-2">
<h2 id="sec-6">Feedback?</h2>
<div class="outline-text-2" id="text-6">
<p>
Do you keep other types of notes, and/or do you have tips for managing
notes? Please share them here so that I can think about how Emacs can be
tweaked to support them!
</p>
</div>
</div>
</div>
<div id="postamble" class="status">
<div class="back-to-top"><a href="#top">Back to top</a> | <a href="mailto:sacha@sachachua.com">E-mail me</a></div>
</div>
</body>
</html>
